<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Introducci칩n" data-toc-modified-id="Introducci칩n-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Introducci칩n</a></span></li><li><span><a href="#Los-datos" data-toc-modified-id="Los-datos-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Los datos</a></span></li><li><span><a href="#M칠todos-de-uni칩n-de-datos" data-toc-modified-id="M칠todos-de-uni칩n-de-datos-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>M칠todos de uni칩n de datos</a></span><ul class="toc-item"><li><span><a href="#concat()" data-toc-modified-id="concat()-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span><code>concat()</code></a></span></li><li><span><a href="#merge()" data-toc-modified-id="merge()-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span><code>merge()</code></a></span><ul class="toc-item"><li><span><a href="#Inner-merge" data-toc-modified-id="Inner-merge-3.2.1"><span class="toc-item-num">3.2.1&nbsp;&nbsp;</span>Inner merge</a></span></li><li><span><a href="#Left-merge" data-toc-modified-id="Left-merge-3.2.2"><span class="toc-item-num">3.2.2&nbsp;&nbsp;</span>Left merge</a></span></li></ul></li><li><span><a href="#join()" data-toc-modified-id="join()-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span><code>join()</code></a></span></li></ul></li><li><span><a href="#Limpieza-del-DataFrame" data-toc-modified-id="Limpieza-del-DataFrame-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Limpieza del <em>DataFrame</em></a></span><ul class="toc-item"><li><span><a href="#Eliminamos-columnas-que-tienen-informaci칩n-redundante." data-toc-modified-id="Eliminamos-columnas-que-tienen-informaci칩n-redundante.-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Eliminamos columnas que tienen informaci칩n redundante.</a></span></li><li><span><a href="#Homogeneizamos-el-nombre-de-las-columnas" data-toc-modified-id="Homogeneizamos-el-nombre-de-las-columnas-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>Homogeneizamos el nombre de las columnas</a></span></li><li><span><a href="#Cambiamos-los-valores-de-las-columnas-a-min칰scula" data-toc-modified-id="Cambiamos-los-valores-de-las-columnas-a-min칰scula-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>Cambiamos los valores de las columnas a min칰scula</a></span></li><li><span><a href="#Creamos-dos-columnas-nuevas-con-el-a침o-y-el-mes-de-la-fecha-en-que-se-contactaron-a-los-clientes-en-la-campa침a-de-marketing" data-toc-modified-id="Creamos-dos-columnas-nuevas-con-el-a침o-y-el-mes-de-la-fecha-en-que-se-contactaron-a-los-clientes-en-la-campa침a-de-marketing-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>Creamos dos columnas nuevas con el a침o y el mes de la fecha en que se contactaron a los clientes en la campa침a de marketing</a></span></li><li><span><a href="#Reemplazamos-los-'.'-por-espacios-en-la-columna-education" data-toc-modified-id="Reemplazamos-los-'.'-por-espacios-en-la-columna-education-4.5"><span class="toc-item-num">4.5&nbsp;&nbsp;</span>Reemplazamos los '.' por espacios en la columna <code>education</code></a></span></li><li><span><a href="#Filtrado-de-datos" data-toc-modified-id="Filtrado-de-datos-4.6"><span class="toc-item-num">4.6&nbsp;&nbsp;</span>Filtrado de datos</a></span><ul class="toc-item"><li><span><a href="#Operadores-de-comparaci칩n" data-toc-modified-id="Operadores-de-comparaci칩n-4.6.1"><span class="toc-item-num">4.6.1&nbsp;&nbsp;</span>Operadores de comparaci칩n</a></span></li><li><span><a href="#M칠todo-.isin()" data-toc-modified-id="M칠todo-.isin()-4.6.2"><span class="toc-item-num">4.6.2&nbsp;&nbsp;</span>M칠todo <code>.isin()</code></a></span></li><li><span><a href="#M칠todo-.between()" data-toc-modified-id="M칠todo-.between()-4.6.3"><span class="toc-item-num">4.6.3&nbsp;&nbsp;</span>M칠todo <code>.between()</code></a></span></li><li><span><a href="#M칠todo-.str.contains()" data-toc-modified-id="M칠todo-.str.contains()-4.6.4"><span class="toc-item-num">4.6.4&nbsp;&nbsp;</span>M칠todo <code>.str.contains()</code></a></span></li></ul></li></ul></li><li><span><a href="#Ejercicios" data-toc-modified-id="Ejercicios-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Ejercicios</a></span></li></ul></div>

# Introducci칩n 

Comenzamos una nueva lecci칩n y en esta ocasi칩n, exploraremos los m칠todos de uni칩n en Pandas, una herramienta fundamental para combinar y analizar conjuntos de datos relacionados. En nuestro caso, trabajaremos con dos DataFrames que contienen informaci칩n personal de los clientes a lo largo de tres a침os, junto con un tercer DataFrame que detalla una campa침a de marketing para impulsar las compras.

En el mundo del an치lisis de datos, a menudo nos encontramos con el desaf칤o de trabajar con m칰ltiples fuentes de informaci칩n. Puede que tengamos datos hist칩ricos en diferentes per칤odos de tiempo, informaci칩n adicional sobre los clientes o incluso campa침as de marketing dise침adas para influir en su comportamiento de compra. Aqu칤 es donde entran en juego los m칠todos de uni칩n en Pandas.

En esta lecci칩n, aprenderemos c칩mo utilizar las funciones de uni칩n, como *merge*, *concat* y *join*, para combinar nuestros DataFrames y obtener una visi칩n completa de la informaci칩n. Veremos c칩mo podemos utilizar columnas comunes como claves de uni칩n para vincular los datos (igual que hac칤amos en SQL con los *joins*) de manera significativa y realizar an치lisis m치s profundos.

A trav칠s de ejemplos pr치cticos y ejercicios interactivos, descubriremos c칩mo unir los DataFrames correspondientes a los diferentes a침os y combinarlos con la informaci칩n de la campa침a de marketing. Aprenderemos a identificar y resolver posibles desaf칤os que puedan surgir durante el proceso de uni칩n, como datos faltantes, duplicados o diferentes estructuras de datos.

El uso de las funciones de combinaci칩n de datos en Pandas, como *merge*, *concat* y *join*, es muy 칰til para los analistas de datos por las siguientes razones:

1. Combinar datos de m칰ltiples fuentes: En el an치lisis de datos, a menudo trabajamos con datos provenientes de diferentes fuentes, como bases de datos, archivos CSV, hojas de c치lculo, etc. Las funciones de combinaci칩n de datos nos permiten unir o concatenar estos conjuntos de datos en una 칰nica estructura, lo que facilita su manipulaci칩n y an치lisis.

2. Ampliar conjuntos de datos: En ocasiones, necesitamos agregar informaci칩n adicional a un conjunto de datos existente. Con merge, concat y join, podemos combinar diferentes conjuntos de datos utilizando columnas comunes como clave de uni칩n, lo que nos permite agregar m치s informaci칩n a nuestros datos.

3. An치lisis de datos relacionales: Cuando trabajamos con datos relacionales, es decir, datos que est치n vinculados por una relaci칩n l칩gica, las funciones de combinaci칩n de datos son fundamentales. Nos permiten unir tablas o conjuntos de datos bas치ndonos en claves relacionales, como identificadores 칰nicos, y realizar an치lisis combinados, como agregaciones o filtrados, en funci칩n de esas relaciones.

4. Limpiar y transformar datos: Las funciones de combinaci칩n tambi칠n son 칰tiles para limpiar y transformar datos. Por ejemplo, podemos combinar conjuntos de datos para eliminar duplicados, filtrar registros basados en condiciones espec칤ficas, reordenar columnas o realizar c치lculos derivados.

5. Integraci칩n de datos estructurados y no estructurados: En algunos casos, es posible que tengamos datos estructurados (por ejemplo, tablas) y datos no estructurados (por ejemplo, texto o im치genes) que necesitemos integrar para un an치lisis completo. Las funciones de combinaci칩n de datos nos permiten unir estos diferentes tipos de datos y realizar an치lisis m치s profundos y completos.

# Los datos

Para esta lecci칩n haremos uso de dos conjuntos de datos diferentes, estos son: 

- `bank-additional.csv`: Es el *csv* con el que hemos estado trabajando hasta ahora en las lecciones de Pandas

- `customer-details.xlsx`: Es un excel que proporcionan informaci칩n sobre las caracter칤sticas demogr치ficas y comportamiento de compra de los clientes del banco. Este excel consta de 3 hojas de trabajo diferentes, en cada una de ellas tenemos los clientes que entraron en el banco en diferentes a침os. Sus columnas son:

    - **Income**: Representa el ingreso anual del cliente en t칠rminos monetarios.

    - **Kidhome**: Indica el n칰mero de ni침os en el hogar del cliente.

    - **Teenhome**: Indica el n칰mero de adolescentes en el hogar del cliente.

    - **Dt_Customer**: Representa la fecha en que el cliente se convirti칩 en cliente de la empresa.

    - ***NumWebVisitsMonth***: Indica la cantidad de visitas mensuales del cliente al sitio web de la empresa.

    - **ID**: Identificador 칰nico del cliente.


Nuestro objetivo en esta lecci칩n es unir todos los datos para tener toda la informaci칩n centralizada y poder trabajar de forma m치s eficiente. Para ello tendremos que:

- Unir las 3 hojas de trabajo del Excel en un solo DataFrame, querremos apilar una hoja de trabajo debajo de otra. 

- Unir las 3 hojas (que ya estar치n en un 칰nico DataFrame) con el *csv* de 'bank-additional'.

# M칠todos de uni칩n de datos

Como ya hemos comentado en Pandas tenemos tres m칠todos para unir datos, veamos una peque침a descripci칩n antes de ponernos manos a la obra: 


- **Concat**: El m칠todo `concat` se utiliza para combinar dos o m치s DataFrames vertical u horizontalmente. Permite unir los DataFrames a lo largo de un eje (por defecto, el eje 0, que es el eje de las filas) para crear un nuevo DataFrame. No hay una columna de referencia espec칤fica para unir los DataFrames, simplemente se concatenan uno tras otro.

- **Merge**: El m칠todo `merge` se utiliza para combinar dos DataFrames bas치ndose en una o m치s columnas comunes. Es similar a la operaci칩n de *join* en SQL. Se especifica una o m치s columnas clave para unir los DataFrames y se pueden seleccionar diferentes tipos de combinaciones, como *inner join*, *left join*, *right join* o *outer join*. El resultado es un nuevo DataFrame que combina las filas de los DataFrames de acuerdo con las columnas clave.

- **Join**: El m칠todo `join` tambi칠n se utiliza para combinar dos DataFrames, pero se basa en las etiquetas de 칤ndice en lugar de columnas comunes. Puede unir DataFrames en funci칩n de los 칤ndices y realizar una combinaci칩n similar a la operaci칩n de *join* en SQL. Al igual que `merge`, se pueden seleccionar diferentes tipos de combinaciones.

Diferencias:

- `Concat`: Se utiliza para combinar DataFrames simplemente apil치ndolos uno encima del otro o uno al lado del otro, sin tener en cuenta las columnas espec칤ficas o las claves de uni칩n.

- `Merge`: Se utiliza para combinar DataFrames en funci칩n de una o m치s columnas comunes. Es similar a la operaci칩n de uni칩n en SQL.

- `Join`: Se utiliza para combinar DataFrames en funci칩n de las etiquetas de 칤ndice en lugar de columnas comunes. Se puede considerar como una variante de `merge` que se basa en los 칤ndices en lugar de las columnas.

In [1]:
# importamos las librer칤as que necesitamos

# Tratamiento de datos
# -----------------------------------------------------------------------
import pandas as pd
import numpy as np


# Configuraci칩n
# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

In [3]:
# antes de empezar vamos a leer los datos, el primero que importaremos ser치 el csv donde tenemos la informaci칩n de la campa침a de marketing
df_mar = pd.read_csv("datos/bank-additional.csv", index_col=0)
df_mar.head(1)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y,date,latitude,longitude,id_
0,NaN,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,089b39d8-e4d0-461b-87d4-814d71e0e079

In [5]:
# vamos ahora a cargar el archivo de excel, recordemos que ten칤amos el m칠todo 'pd.read_excel()'
# adem치s recuerda que este m칠todo, que vimos en la lecci칩n de este m칩dulo, tiene un par치metro que se llama 'sheet_name' que nos permite elegir la hoja de trabajo que queremos abrir en Pandas
# 游뚿 Nuestras hojas de trabajo se llaman '2012', '2013', '2014' 

df_2012 = pd.read_excel("datos/customer-details.xlsx", sheet_name="2012", index_col = 0)
df_2013 = pd.read_excel("datos/customer-details.xlsx", sheet_name="2013", index_col = 0)
df_2014 = pd.read_excel("datos/customer-details.xlsx", sheet_name="2014", index_col = 0)

In [6]:
# comprobamos que los datos se han cargado correctamente
df_2012.head(1)

,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079

In [5]:
# miramos los datos del DataFrame df_2013
df_2013.head(1)

,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID
0,82407,0,1,2013-10-07,29,ef81336c-e41a-46d0-8a30-5d4ac3b836be

In [6]:
# chequeamos el 칰ltimo DataFrame
df_2014.head(1)

,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID
0,168812,1,1,2014-06-10,27,4d6c811c-0f24-4a73-b374-2ebd1f80d46e

**쯈u칠 es lo que tenemos en todos los DataFrames que hemos cargado?**

- En el excel tenemos tres set de datos diferentes, pero que si nos fijamos tienen la misma informaci칩n y columnas, con la diferencia de que en cada DataFrame tenemos los clientes que pasaron a ser clientes en 3 diferentes a침os. Estos los podr칤amos unificar en solo uno. 

- Adem치s, estos conjuntos de datos tienen una columna con el 'id' personal de cada cliente, que si nos fijamos es lo mismo que la columna 'id_' del csv. En este caso podremos unirlos como hac칤amos con los joins en SQL.

## `concat()`

El m칠todo `concat()` se utiliza para concatenar (unir) objetos de pandas a lo largo de un eje espec칤fico(filas o columnas). Puede ser utilizado para concatenar DataFrames o Series de pandas. Su sintaxis es:

```python
pd.concat(objs, axis=0, join='outer', ignore_index=False)
```

Par치metros principales:
- `objs`: Es un iterable de objetos de pandas (por ejemplo, DataFrames, Series) que se desean concatenar. Se puede pasar como una lista o un diccionario de objetos.

- `axis`: Especifica el eje a lo largo del cual se va a realizar la concatenaci칩n. Sus valores pueden ser: 

    - `axis=0` (por defecto) le dice a pandas que apile el segundo DataFrame DEBAJO del primero. Es decir, estamos concatenando por **filas**.
        > Cuando usamos este eje, tenemos que asegurarnos de que tenemos las mismas columnas y el mismo formato de columna asociado en ambos conjuntos de datos. En caso de que tengamos alguna columna que no este en los dos dataframes, nos pondr치 NaN en los valores para el *DataFrame* que no ten칤a esa columna.

    - `axis=1` apilar치 las columnas del segundo DataFrame a la DERECHA del primer DataFrame. Es decir, estamos concatenando por **columnas** .
        > Cuando usamos este eje, queremos asegurarnos de que lo que estamos haciendo tiene sentido (es decir, los datos est치n relacionados de alguna manera).

- `join` (opcional): Especifica c칩mo se deben manejar las columnas que no se encuentran en todos los objetos. Puede ser 'outer' (uni칩n de todas las columnas), 'inner' (intersecci칩n de las columnas comunes) u otras opciones.

- `ignore_index` (opcional): Indica si se deben restablecer los 칤ndices originales y generar nuevos 칤ndices en el resultado concatenado. Por defecto es `False`.

Para poner en pr치ctica este tipo de uni칩n usaremos los tres DataFrames que hemos cargado desde el Excel. El objetivo ser치 tener toda la informaci칩n personal de todos los clientes en un 칰nico DataFrame.

In [7]:
# recordamos los 3 DataFrames
df_2012.head(2)

,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079
1,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097

In [8]:
df_2013.head(2)

,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID
0,82407,0,1,2013-10-07,29,ef81336c-e41a-46d0-8a30-5d4ac3b836be
1,24877,0,0,2013-04-21,32,50b224ac-84b4-42a7-aba9-3e1d1d620479

In [9]:
df_2014.head(2)

,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID
0,168812,1,1,2014-06-10,27,4d6c811c-0f24-4a73-b374-2ebd1f80d46e
1,108615,2,1,2014-04-05,24,eef0f24f-cbdb-4c67-b371-09d7bc59695e

In [7]:
# en este primer ejemplo vamos a unir los 3 DataFrames por las filas 'axis=0'. 
# Fijaos como al m칠todo 'pd.concat' le hemos pasado una lista con los nombres de los DataFrames que queremos unir
# usando el par치metro 'ignore_index = True' le decimos que reestablezca los 칤ndices del DataFrame nuevo generado, de esta forma los 칤ndices ir치n del 1-n (siendo n el n칰mero total de filas que tenemos en el nuevo DataFrame)
df_concat0 = pd.concat([df_2012, df_2013, df_2014], axis=0, ignore_index = True)
df_concat0.head()

,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079
1,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097
2,147233,1,1,2012-02-02,5,3f9f49b5-e410-4948-bf6e-f9244f04918b
3,121393,1,2,2012-12-21,29,9991fafb-4447-451a-8be2-b0df6098d13e
4,63164,1,2,2012-06-20,20,eca60b76-70b6-4077-80ba-bc52e8ebb0eb

Si nos fijamos, el n칰mero de filas del *DataFrame* concatenado `df_concat0` es el resultado de la suma de los tres *DataFrames*.

In [11]:
print(f"las filas y columnas que tenemos en el df_2012 son {df_2012.shape}")
print("-------------------------------------------------------------------")


print(f"las filas y columnas que tenemos en el df_2013 son {df_2013.shape}")
print("-------------------------------------------------------------------")


print(f"las filas y columnas que tenemos en el df_2014 son {df_2014.shape}")
print("-------------------------------------------------------------------")


print(f"las filas y columnas que tenemos en el df_concat0 {df_concat0.shape}")
print("-------------------------------------------------------------------")

las filas y columnas que tenemos en el df_2012 son (20115, 6)
-------------------------------------------------------------------
las filas y columnas que tenemos en el df_2013 son (8965, 6)
-------------------------------------------------------------------
las filas y columnas que tenemos en el df_2014 son (14090, 6)
-------------------------------------------------------------------
las filas y columnas que tenemos en el df_concat0 (43170, 6)
-------------------------------------------------------------------

In [8]:
# pongamos ahora un ejemplo de concatenaci칩n cambiando del valor del par치metro axis. 
# si te fijas lo que hemos hecho es juntar los tres dataframes, uno al lado del otro.
df_concat1 = pd.concat([df_2012, df_2013, df_2014], axis=1)
df_concat1.head()

,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079,82407.0,0.0,1.0,2013-10-07,29.0,ef81336c-e41a-46d0-8a30-5d4ac3b836be,168812.0,1.0,1.0,2014-06-10,27.0,4d6c811c-0f24-4a73-b374-2ebd1f80d46e
1,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097,24877.0,0.0,0.0,2013-04-21,32.0,50b224ac-84b4-42a7-aba9-3e1d1d620479,108615.0,2.0,1.0,2014-04-05,24.0,eef0f24f-cbdb-4c67-b371-09d7bc59695e
2,147233,1,1,2012-02-02,5,3f9f49b5-e410-4948-bf6e-f9244f04918b,78839.0,1.0,0.0,2013-11-25,21.0,9cb15c53-b647-464a-add9-09cdae04897c,179041.0,0.0,2.0,2014-09-22,4.0,bbfdcedd-199d-4927-94bb-5dad051ff471
3,121393,1,2,2012-12-21,29,9991fafb-4447-451a-8be2-b0df6098d13e,113859.0,1.0,1.0,2013-01-06,12.0,f8aaf334-949d-4943-a214-b64fe9c088b4,116639.0,2.0,2.0,2014-08-16,3.0,e8ebb67d-4ee1-4615-b701-eefe3af607eb
4,63164,1,2,2012-06-20,20,eca60b76-70b6-4077-80ba-bc52e8ebb0eb,147317.0,0.0,0.0,2013-07-10,14.0,885fe85a-3718-4760-a32a-a57628cf7528,49537.0,0.0,1.0,2014-09-05,28.0,f7f79ace-0024-4505-a401-f340946f0942

## `merge()`

Probablemente la forma m치s com칰n de unir *DataFrames* basado en algunas condiciones comunes. Se utiliza para combinar (fusionar) dos o m치s DataFrames en funci칩n de una o m치s columnas comunes. Puede realizar operaciones de uni칩n similar a las que se encuentran en las bases de datos relacionales como SQL. Su sintaxis es:

```python
df_left.merge(df_right, how='inner', on=None, left_on=None, right_on=None)
```
Donde: 

- `df_left` y `df_right`: Son los DataFrames que se van a combinar.

- `how` (opcional): Especifica el tipo de uni칩n a realizar. Los valores comunes son: 
    - `left`: usa s칩lo las claves del *DataFrame* izquierdo, similar a una uni칩n externa izquierda de SQL.

    - `right`: usa s칩lo las claves del *DataFrame* derecho, similar a una uni칩n externa derecha de SQL.

    - `outer`: utiliza la uni칩n de las claves de ambos *DataFrame*, es decir, me va a devolver todo. 
    
    - `inner`: utiliza la intersecci칩n de las claves de ambos *DataFrame*, similar a una uni칩n interna de SQL.

    - `cross`: crea el producto cartesiano de ambos marcos, conserva el orden de las claves de la izquierda.


- `on`: Especifica la(s) columna(s) com칰n(es) en la que se basar치 la fusi칩n. Si las columnas tienen el mismo nombre en ambos DataFrames, se puede especificar como una cadena. Si las columnas tienen nombres diferentes, se puede especificar como una lista de nombres de columna correspondientes.

- `left_on` y `right_on` (opcional): Permiten especificar columnas diferentes en `left` y `right` en las que se basar치 la fusi칩n.

- `suffixes` (opcional): Especifica los sufijos a agregar a las columnas que se solapan en `left` y `right`. Por defecto, se agrega `_x` a las columnas de `left` y `_y` a las columnas de `right`.


**쯇or qu칠 hacemos esta diferenciaci칩n entre `on`, `left_on` y `right_on`?**

- Podemos usar `on` si los nombres de las columnas por las que queremos unir nuestros *datasets* se llaman igual. 

- Por el contrario, si las columnas por las que vamos a mergear nuestros *DataFrames* tienen distintos nombres usaremos `left_on` y `right_on`.
Para entenderlo mejor por defecto, el `merge` es como un *inner join* de SQL. 

En este caso uniremos el DataFrame creado en el primer ejemplo del concat que vimos previamente y el DataFrame de la campa침a de marketing, el que cargamos desde el *csv*

In [13]:
# recordemos el DataFrame de la campa침a de marketing
df_mar.head(2)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y,date,latitude,longitude,id_
0,NaN,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,089b39d8-e4d0-461b-87d4-814d71e0e079
1,57.0,services,MARRIED,high.school,NaN,0.0,0.0,telephone,149,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,14-septiembre-2016,34.601,-83.923,e9d37224-cb6f-4942-98d7-46672963d097

In [14]:
# recordemosel DataFrame creado en el concat
df_concat0.head(2)

,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079
1,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097

In [15]:
print(f"las filas y columnas que tenemos en el df concatenado son {df_concat0.shape}")
print("-------------------------------------------------------------------")


print(f"las filas y columnas que tenemos en el df_mar son {df_mar.shape}")
print("-------------------------------------------------------------------")

las filas y columnas que tenemos en el df concatenado son (43170, 6)
-------------------------------------------------------------------
las filas y columnas que tenemos en el df_mar son (43000, 23)
-------------------------------------------------------------------

Por otro lado, veamos los nombres de columnas que tenemos en los *DataFrames*.

In [16]:
print(f"los nombres de columnas que tenemos en el df concatenado son \n\n{df_concat0.columns}")
print("-------------------------------------------------------------------")


print(f"los nombres de columnas que tenemos en el df_mar son \n\n {df_mar.columns}")
print("-------------------------------------------------------------------")

los nombres de columnas que tenemos en el df concatenado son

Index(['Income', 'Kidhome', 'Teenhome', 'Dt_Customer', 'NumWebVisitsMonth',
       'ID'],
      dtype='object')
-------------------------------------------------------------------
los nombres de columnas que tenemos en el df_mar son

 Index(['age', 'job', 'marital', 'education', 'default', 'housing', 'loan',
       'contact', 'duration', 'campaign', 'pdays', 'previous', 'poutcome',
       'emp.var.rate', 'cons.price.idx', 'cons.conf.idx', 'euribor3m',
       'nr.employed', 'y', 'date', 'latitude', 'longitude', 'id_'],
      dtype='object')
-------------------------------------------------------------------

Si nos fijamos, tenemos varias columnas diferentes entre los *DataFrames*, peeeero hay una columna que comparten! La de `id_` en el DataFrame de la campa침a de marketing y la columna de 'ID' en el DataFrame concatenado. Esta columna ser치 la que nos permita hacer el mergeo entre los dos *DataFrames*.

### Inner merge

Cuando se realiza un *inner merge*, tambi칠n conocido como intersecci칩n, se combinan los datos de dos *DataFrames* en funci칩n de una o m치s columnas comunes, pero solo se conservan las filas donde las columnas coinciden en ambos DataFrames. Como tenemos una columna en com칰n pero que se llaman diferente en los *DataFrames* usaremos el par치metro `right_on` y `left_on`.

In [9]:
mergeado_inner = df_concat0.merge(df_mar, left_on='ID', right_on = "id_")
mergeado_inner.head()

,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y,date,latitude,longitude,id_
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079,NaN,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,089b39d8-e4d0-461b-87d4-814d71e0e079
1,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097,57.0,services,MARRIED,high.school,NaN,0.0,0.0,telephone,149,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,14-septiembre-2016,34.601,-83.923,e9d37224-cb6f-4942-98d7-46672963d097
2,147233,1,1,2012-02-02,5,3f9f49b5-e410-4948-bf6e-f9244f04918b,37.0,services,MARRIED,high.school,0.0,1.0,0.0,telephone,226,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,15-febrero-2019,34.939,-94.847,3f9f49b5-e410-4948-bf6e-f9244f04918b
3,121393,1,2,2012-12-21,29,9991fafb-4447-451a-8be2-b0df6098d13e,40.0,admin.,MARRIED,basic.6y,0.0,0.0,0.0,telephone,151,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,29-noviembre-2015,49.041,-70.308,9991fafb-4447-451a-8be2-b0df6098d13e
4,63164,1,2,2012-06-20,20,eca60b76-70b6-4077-80ba-bc52e8ebb0eb,56.0,services,MARRIED,high.school,0.0,0.0,1.0,telephone,307,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,29-enero-2017,38.033,-104.463,eca60b76-70b6-4077-80ba-bc52e8ebb0eb

In [18]:
print(f"las filas y columnas que tenemos en el df concatenado son {df_concat0.shape}")
print("-------------------------------------------------------------------")

print(f"las filas y columnas que tenemos en el df de marketing son {df_mar.shape}")
print("-------------------------------------------------------------------")

print(f"las filas y columnas que tenemos en el mergeado_inner son {mergeado_inner.shape}")
print("-------------------------------------------------------------------")

las filas y columnas que tenemos en el df concatenado son (43170, 6)
-------------------------------------------------------------------
las filas y columnas que tenemos en el df de marketing son (43000, 23)
-------------------------------------------------------------------
las filas y columnas que tenemos en el mergeado_inner son (43000, 29)
-------------------------------------------------------------------

Fijaos que ahora tenemos nuestros *datasets* unidos, se nos han juntado las columnas de los *DataFrames* en aquellos valores que coinciden los valores de `id_`, que es por donde hemos especificado que mergee. 

> Tenemos el mismo n칰mero filas en el *DataFrame* mergeado que en el de la campa침a de marketing.  Esto es as칤 porque hay 'id'  que est치n en `df_concat0` y no en `df_mar`. Como no encuentra el "match" los elimina. Es decir no se ha llamado a todos los clientes. 
>
>El *DataFrame* `mergeado_inner` resultante contiene todas las columnas de `df_concat` as칤 como todas las columnas de `df_mar`.
>
>Tambi칠n observamos que la columna del 'id_' y 'ID', es decir las columnas por las que hemos mergeado est치n incluidas en *DataFrame* final, es decir, tenemos columnas redundantes.

```python
# 游늷en caso de que las columnas que vamos a unir se hubieran llamado igual tendr칤amos que hacer usado la siguiente sintaxis, usando el par치metro 'on', en vez de 'right_on' y 'left_on': 

mergeado_inner2 = df_2002.merge(df_species, on = "NOMBRE_COLUMNA_COM칔N")
mergeado_inner2.head()
```

### Left merge

Cuando se realiza un *left merge*, tambi칠n conocido como uni칩n izquierda, se combinan los datos de dos *DataFrames* en funci칩n de una o m치s columnas comunes, y se conservan todas las filas del *DataFrame* de la izquierda (el primer *DataFrame* especificado en la fusi칩n), incluyendo las filas que no tienen coincidencias en el *DataFrame* de la derecha.

In [10]:
mergeado_izq = df_concat0.merge( right=df_mar, how='left',
                        left_on='ID', right_on='id_')

mergeado_izq.head()

,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y,date,latitude,longitude,id_
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079,NaN,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261.0,1.0,999.0,0.0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,089b39d8-e4d0-461b-87d4-814d71e0e079
1,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097,57.0,services,MARRIED,high.school,NaN,0.0,0.0,telephone,149.0,1.0,999.0,0.0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,14-septiembre-2016,34.601,-83.923,e9d37224-cb6f-4942-98d7-46672963d097
2,147233,1,1,2012-02-02,5,3f9f49b5-e410-4948-bf6e-f9244f04918b,37.0,services,MARRIED,high.school,0.0,1.0,0.0,telephone,226.0,1.0,999.0,0.0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,15-febrero-2019,34.939,-94.847,3f9f49b5-e410-4948-bf6e-f9244f04918b
3,121393,1,2,2012-12-21,29,9991fafb-4447-451a-8be2-b0df6098d13e,40.0,admin.,MARRIED,basic.6y,0.0,0.0,0.0,telephone,151.0,1.0,999.0,0.0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,29-noviembre-2015,49.041,-70.308,9991fafb-4447-451a-8be2-b0df6098d13e
4,63164,1,2,2012-06-20,20,eca60b76-70b6-4077-80ba-bc52e8ebb0eb,56.0,services,MARRIED,high.school,0.0,0.0,1.0,telephone,307.0,1.0,999.0,0.0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,29-enero-2017,38.033,-104.463,eca60b76-70b6-4077-80ba-bc52e8ebb0eb

In [20]:
print(f"las filas y columnas que tenemos en el df_concat son {df_concat0.shape}")
print("-------------------------------------------------------------------")


print(f"las filas y columnas que tenemos en el mergeado_izquierda son {mergeado_izq.shape}")
print("-------------------------------------------------------------------")

las filas y columnas que tenemos en el df_concat son (43170, 6)
-------------------------------------------------------------------
las filas y columnas que tenemos en el mergeado_izquierda son (43170, 29)
-------------------------------------------------------------------

El *DataFrame* resultante de una *left join* se parece mucho al resultado del *inner join* en cuanto a las columnas que contiene. Sin embargo, a diferencia del *inner_join* (`mergeado_inner`), *left_join* (`mergeado_izq`) contiene el mismo n칰mero de filas que el *DataFrame* original de `df_concat0`. 

Cuando examinamos `mergeado_izq`, encontramos que hay filas en las que falta la informaci칩n que deber칤a proceder de `df_mar`. Es decir, se han generado 170 nulos en algunas columnas

> Tenemos 170 NaN , esto significa que hay 170 clientes que ten칤amos en el `df_concat0` que NO aparec칤an en `df_mar`, es decir, los clientes a los que no se contacto en la campa침a de marketing.

## `join()`

Se utiliza para combinar los datos de dos DataFrames en funci칩n de los 칤ndices de las filas. Proporciona una forma conveniente de realizar uniones basadas en 칤ndices en lugar de columnas.

La sintaxis b치sica del m칠todo `join()` es la siguiente:

```python
resultado = df_left.join(df_right, how='tipo_de_join',  lsuffix='', rsuffix='')
```

Donde:

- `df_left` y `df_right`: Son los *DataFrames* que se desean combinar.

- `how='tipo_de_join'` (opcional): Especifica el tipo de join que se va a realizar. Los tipos de join comunes son `'left'`, `'right'`, `'inner'` y `'outer'`, y se utilizan de manera similar a los tipos de join en el m칠todo `merge()`.

- `lsuffix` (opcional): Por defecto nada, en caso de que coincidan columnas en los DataFrames que queremos unir, ser치 el sufijo que aparecer치 en esas columnas en el DataFrame izquierdo.

- `rsuffix` (opcional): por defecto nada, en caso de que coincidan columnas en los DataFrames que queremos unir, ser치 el sufijo que aparecer치 en esas columnas en el DataFrame derecho.

El resultado del m칠todo `join()` es un nuevo DataFrame que combina los datos de `dataframe1` y `dataframe2` en funci칩n de los 칤ndices de las filas. Las filas se unen en funci칩n de los 칤ndices coincidentes, y las filas que no tienen coincidencias se excluyen del resultado final.

Es importante destacar que el m칠todo `join()` se basa en los 칤ndices de las filas, por lo que las columnas con los mismos nombres en ambos *DataFrames* se manejan autom치ticamente. Si los *DataFrames* tienen columnas con nombres diferentes, se pueden utilizar los par치metros `on` o `left_on` y `right_on` para especificar las columnas en las que se basar치 la uni칩n, al igual que haciamos en el *merge*. 

游늷 **NOTA** Es importante que en el  caso de los `join()` a parte de que una de las columnas por las que uniremos tiene que estar en el 칤ndice, las columnas se tienen que llamar exactamente igual. Por lo tanto, antes de hacer el join tendremos que: 

- Cambiar el nombre de una de las columnas. 

- Poner una de las columnas como 칤ndice del *DataFrame*.

In [21]:
print(f"las filas y columnas que tenemos en el df_concat0 son {df_concat0.shape}")
print("-------------------------------------------------------------------")


print(f"las filas y columnas que tenemos en el df_mar son {df_mar.shape}")
print("-------------------------------------------------------------------")

las filas y columnas que tenemos en el df_concat0 son (43170, 6)
-------------------------------------------------------------------
las filas y columnas que tenemos en el df_mar son (43000, 23)
-------------------------------------------------------------------

Lo primero que vamos a hacer es cambiar el nombre de la columna `id_` por `ID`, para eso usaremos el m칠todo `rename()`. Este m칠todo se utiliza para cambiar los nombres de columnas, 칤ndices o ambos en un DataFrame. Proporciona la capacidad de renombrar las etiquetas de las filas y columnas de manera flexible y conveniente.

La sintaxis b치sica del m칠todo `rename()` es la siguiente:

```python
dataframe.rename(columns=nombre_columnas, index=nombre_filas, inplace=False)
```

Donde:
- `dataframe`: Es el DataFrame al que deseas aplicar la operaci칩n de renombrar.

- `columns`: Es un diccionario o mapeo que especifica los nombres de columnas a cambiar. Las claves del diccionario representan los nombres actuales de las columnas, y los valores correspondientes son los nombres nuevos que deseas asignarles.

- `index` (opcional): Es un diccionario o mapeo que especifica los nombres de filas a cambiar. Las claves del diccionario representan los nombres actuales de las filas, y los valores correspondientes son los nombres nuevos que deseas asignarles.

- `inplace` (opcional): Es un par치metro booleano opcional que indica si se debe modificar el DataFrame original o si se debe crear un nuevo DataFrame con los nombres cambiados. Por defecto, su valor es `False`, lo que significa que se crear치 un nuevo DataFrame con los nombres modificados.

In [22]:
df_mar.head(1)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y,date,latitude,longitude,id_
0,NaN,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,089b39d8-e4d0-461b-87d4-814d71e0e079

In [11]:
# cambiamos el nombre de la columna 'id_' por 'ID' en el DataFrame de df_mar usando el m칠todo rename()
df_mar.rename(columns = {"id_": "ID"}, inplace = True )

# chequeamos que el cambio se ha realizado
df_mar.head(2)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y,date,latitude,longitude,ID
0,NaN,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,089b39d8-e4d0-461b-87d4-814d71e0e079
1,57.0,services,MARRIED,high.school,NaN,0.0,0.0,telephone,149,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,14-septiembre-2016,34.601,-83.923,e9d37224-cb6f-4942-98d7-46672963d097

Una vez que hemos cambiado el nombre de una de las columnas lo siguiente que tenemos que hacer es establecer alguna de las columnas que tienen en com칰n los dos *DataFrames* (`ID` o `id_`) como 칤ndice. Para eso vamos a usar un m칠todo que no hab칤amos visto todav칤a, el `set_index()`. Este m칠todo se utiliza para establecer una o m치s columnas como 칤ndices de un *DataFrame*. Cambia la estructura del DataFrame de modo que los valores de una o m치s columnas se conviertan en los 칤ndices de las filas.

La sintaxis b치sica del m칠todo `set_index()` es la siguiente:

```python
dataframe.set_index(keys, drop=True, inplace=False)
```

Donde:

- `dataframe`: Es el DataFrame al que deseas aplicar la funci칩n.

- `keys`: Especifica la columna o columnas que se utilizar치n como 칤ndices. Puede ser un solo nombre de columna o una lista de nombres de columnas si se desean m칰ltiples 칤ndices.

- `drop`(opcional): Es un par치metro booleano opcional que indica si se deben eliminar las columnas utilizadas como 칤ndices del DataFrame resultante. Por defecto, su valor es `True`, lo que significa que las columnas utilizadas como 칤ndices se eliminar치n del DataFrame.

- `inplace` (opcional): Es un par치metro booleano opcional que indica si se debe modificar el DataFrame original o si se debe crear un nuevo DataFrame con los 칤ndices establecidos. Por defecto, su valor es `False`, lo que significa que se crear치 un nuevo DataFrame.

El m칠todo `set_index()` devuelve un nuevo DataFrame con los 칤ndices establecidos seg칰n las columnas especificadas. Si `inplace=True`, el m칠todo modifica el DataFrame original y no devuelve nada.

In [12]:
# utilizamos el m칠todo 'set_index()' para poner la columna de 'ID' como 칤ndice de nuestro DataFrame
df_mar.set_index(["ID"], inplace = True)

# vemos como ha quedado el DataFrame
df_mar.head(1)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y,date,latitude,longitude
ID,,,,,,,,,,,,,,,,,,,,,,
089b39d8-e4d0-461b-87d4-814d71e0e079,NaN,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233

In [25]:
df_concat0.head()

,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079
1,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097
2,147233,1,1,2012-02-02,5,3f9f49b5-e410-4948-bf6e-f9244f04918b
3,121393,1,2,2012-12-21,29,9991fafb-4447-451a-8be2-b0df6098d13e
4,63164,1,2,2012-06-20,20,eca60b76-70b6-4077-80ba-bc52e8ebb0eb

In [13]:
# en este punto el orden es importante, y tendremos pasar primero el DataFrame que no tiene en el 칤ndice la columna y dentro del par칠ntesis el DataFrame que tiene la columna com칰n en el 칤ndice. 
df_join = df_concat0.join(df_mar, on = "ID")
df_join.sample()

,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y,date,latitude,longitude
288,45991,1,2,2012-06-23,2,83eaa440-7893-490f-9b06-f48097dd1882,NaN,blue-collar,MARRIED,NaN,NaN,1.0,0.0,telephone,5.0,2.0,999.0,0.0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,24-julio-2017,45.966,-76.769

In [27]:
print(f"las filas y columnas que tenemos en el df_2002 son {df_mar.shape}")
print("-------------------------------------------------------------------")


print(f"las filas y columnas que tenemos en el mergeado_inner son {df_join.shape}")
print("-------------------------------------------------------------------")

las filas y columnas que tenemos en el df_2002 son (43000, 22)
-------------------------------------------------------------------
las filas y columnas que tenemos en el mergeado_inner son (43170, 28)
-------------------------------------------------------------------

# Limpieza del *DataFrame*

Hasta ahora hemos aprendido a explorar los datos utilizando herramientas b치sicas con Pandas y a como unir datos que vienen de distintas fuentes. Ya tenemos todos los datos para empezar con el an치lisis. Sin embargo, antes de profundizar en el an치lisis tenemos que hacer una transformaci칩n de los mismos, para que nuestras conclusiones sean lo m치s claras posibles, por lo que en esta lecci칩n empezaremos a aprender algunas herramientas importantes que nos pueden ayudar en este proceso. La limpieza de datos desempe침a un papel fundamental en el proceso de ETL (*Extract*, *Transform*, *Load*) en el an치lisis de datos. Asegurarse de que los datos est칠n limpios, consistentes y libres de errores es esencial para obtener resultados precisos y confiables en cualquier an치lisis o proyecto de datos.

Aqu칤 hay algunas razones clave que resaltan la importancia de la limpieza de datos en el proceso de ETL:

1. **Mejora de la calidad de los datos**: La limpieza de datos implica identificar y corregir errores, inconsistencias, valores at칤picos y datos faltantes en los conjuntos de datos. Al realizar estas correcciones, se mejora significativamente la calidad de los datos, lo que a su vez conduce a resultados m치s precisos y confiables en el an치lisis.

2. **Aumento de la confianza en los resultados**: Al eliminar datos incorrectos o inconsistentes, se reduce la posibilidad de obtener conclusiones err칩neas o interpretaciones equivocadas. La limpieza de datos garantiza que los resultados generados a partir del an치lisis se basen en informaci칩n precisa y confiable, lo que aumenta la confianza en los resultados.

3. **Optimizaci칩n del rendimiento**: Los datos limpios y estructurados adecuadamente permiten un procesamiento m치s eficiente y r치pido. Al eliminar datos redundantes, duplicados o innecesarios, se mejora el rendimiento de las consultas y los c치lculos realizados sobre los datos, lo que acelera el tiempo de procesamiento y mejora la eficiencia general del an치lisis.

4. **Facilita la integraci칩n de datos**: Durante el proceso de ETL, a menudo es necesario combinar datos de m칰ltiples fuentes. La limpieza de datos ayuda a estandarizar y normalizar los formatos de datos, lo que facilita la integraci칩n de diferentes conjuntos de datos. Esto asegura una mayor coherencia en el an치lisis.

5. **Cumplimiento de regulaciones y requisitos**: En muchos casos, existen regulaciones y requisitos espec칤ficos que deben cumplirse al realizar an치lisis de datos, especialmente cuando se trata de datos sensibles o confidenciales. La limpieza de datos ayuda a garantizar que los datos cumplan con los est치ndares de privacidad, seguridad y cumplimiento aplicables.

游뚿 A partir de este punto utilizaremos el *DataFrame* que hemos creado resultado del *inner join* que hicimos con el merge. 

Vamos a empezar con algunos cambios peque침os sobre nuestro *DataFrame*, estos son:

- La columna 'ID' y 'id_' contienen la misma informaci칩n, son redundantes, por lo tanto eliminaremos una. 

- Los nombres de las columnas no son homogeneas, algunas est치n en may칰scula, otras tienen puntos en vez de espacios, por lo que vamos a cambiar el nombre de las columnas para que est칠n todas en min칰sculas y sin espacios y puntos. 

- Los valores de algunas columnas (`marital`, `poutcome`) est치n en may칰sculas. Los pondremos todas en min칰sculas. 

- Vamos a crear dos columnas nuevas con el mes y el a침o del d칤a en el que el banco contacto con cada cliente en la campa침a de marketing. 

- La columna de `education` tiene '.' en vez de espacios, los reemplazaremos para no tener los '.'.

In [14]:
# lo primero que vamos a hacer es un copia del DataFrame original usando el m칠todo '.copy()', este m칠todo funciona exactamente igual que el m칠todo '.copy()' que hab칤amos visto en listas, diccionarios, etc
df_final = mergeado_inner.copy()

# verificamos que tenemos el DataFrame correctamente
df_final.head()

,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y,date,latitude,longitude,id_
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079,NaN,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,089b39d8-e4d0-461b-87d4-814d71e0e079
1,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097,57.0,services,MARRIED,high.school,NaN,0.0,0.0,telephone,149,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,14-septiembre-2016,34.601,-83.923,e9d37224-cb6f-4942-98d7-46672963d097
2,147233,1,1,2012-02-02,5,3f9f49b5-e410-4948-bf6e-f9244f04918b,37.0,services,MARRIED,high.school,0.0,1.0,0.0,telephone,226,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,15-febrero-2019,34.939,-94.847,3f9f49b5-e410-4948-bf6e-f9244f04918b
3,121393,1,2,2012-12-21,29,9991fafb-4447-451a-8be2-b0df6098d13e,40.0,admin.,MARRIED,basic.6y,0.0,0.0,0.0,telephone,151,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,29-noviembre-2015,49.041,-70.308,9991fafb-4447-451a-8be2-b0df6098d13e
4,63164,1,2,2012-06-20,20,eca60b76-70b6-4077-80ba-bc52e8ebb0eb,56.0,services,MARRIED,high.school,0.0,0.0,1.0,telephone,307,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,29-enero-2017,38.033,-104.463,eca60b76-70b6-4077-80ba-bc52e8ebb0eb

## Eliminamos columnas que tienen informaci칩n redundante. 

Para eso usaremos el m칠todo `.drop()`, que recordamos en la lecci칩n anterios en el jupyter de `EDA`. Recordemos que hace y cual es la sintaxis de este m칠todo. Este m칠todo nos permit칤a eliminar filas o columnas de nuestro *DataFrame*. Si sintaxis b치sica es:

```python
DataFrame.drop(labels=None, axis=0 , inplace=False, errors='raise')
```

Par치metros:

- `labels`: Especifica los nombres de las filas o columnas que se queremos eliminar. Puede ser un solo valor o una lista de valores.

- `axis`: Indica si se eliminar치n filas (`axis=0`) o columnas (`axis=1`).

- `inplace` (opcional): Es un par치metro opcional que indica si se realizar치 la eliminaci칩n directamente en el DataFrame original (`inplace=True`) o si se crear치 un nuevo DataFrame con los cambios (`inplace=False`, valor por defecto).

- `errors` (opcional): Especifica c칩mo manejar errores cuando se pasan etiquetas que no est치n presentes en el DataFrame. Los valores posibles son: `'raise'` para generar un error, `'ignore'` para omitir las etiquetas y `'coerce'` para establecer los valores faltantes como NaN.

In [15]:
# vamos a quitar la columna "id_", por lo tanto en el par치metro 'axis' le daremos el valor de 1. 
# adem치s como solo queremos quitar una columna le pasaremos el nombre de la columna sin m치s (en caso de que quisieramos quitar m치s columnas deber칤amos pasar una lista con el nombre de todas las columnas)
df_final.drop("id_", axis = 1, inplace = True)

# comprobamos que la columna se ha eliminado correctamente
df_final.head(2)

,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y,date,latitude,longitude
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079,NaN,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233
1,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097,57.0,services,MARRIED,high.school,NaN,0.0,0.0,telephone,149,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,14-septiembre-2016,34.601,-83.923

## Homogeneizamos el nombre de las columnas 

Para eso usaremos el m칠todo `.rename()` que hemos aprendido en esta lecci칩n. Recordad que para ello necesitamos un diccionario donde las *keys* son los nombres antiguos de las columnas y los *value* son los nombres nuevos de las columnas. En el ejemplo que hicimos antes lo hicimos a mano, y esto era aceptable porque solo quer칤amos cambiar el nombre de una columna, pero ahora lo queremos hacer de todas. 쯌amos a construir el diccionario a mano? No! Vamos a hacer una *dict comprehension*

In [16]:
# vamos a iterar por todas las columnas del DataFrame y a cada una de ellas la pondremos en min칰sula y le aplicaremos un replace para quitar los puntos. 
nuevas_columnas = {columna: columna.lower().replace(".", "") for columna in df_final.columns}

# comprobamos que hemos creado el diccionario correctamente
nuevas_columnas

{'Income': 'income',
 'Kidhome': 'kidhome',
 'Teenhome': 'teenhome',
 'Dt_Customer': 'dt_customer',
 'NumWebVisitsMonth': 'numwebvisitsmonth',
 'ID': 'id',
 'age': 'age',
 'job': 'job',
 'marital': 'marital',
 'education': 'education',
 'default': 'default',
 'housing': 'housing',
 'loan': 'loan',
 'contact': 'contact',
 'duration': 'duration',
 'campaign': 'campaign',
 'pdays': 'pdays',
 'previous': 'previous',
 'poutcome': 'poutcome',
 'emp.var.rate': 'empvarrate',
 'cons.price.idx': 'conspriceidx',
 'cons.conf.idx': 'consconfidx',
 'euribor3m': 'euribor3m',
 'nr.employed': 'nremployed',
 'y': 'y',
 'date': 'date',
 'latitude': 'latitude',
 'longitude': 'longitude'}

In [17]:
# una vez que tenemos el diccionario vamos a aplicar el m칠todo rename
df_final.rename(columns = nuevas_columnas, inplace = True)

# comprobamos que se han cambiado los nombres de las columnas
df_final.head()

,income,kidhome,teenhome,dt_customer,numwebvisitsmonth,id,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,empvarrate,conspriceidx,consconfidx,euribor3m,nremployed,y,date,latitude,longitude
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079,NaN,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233
1,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097,57.0,services,MARRIED,high.school,NaN,0.0,0.0,telephone,149,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,14-septiembre-2016,34.601,-83.923
2,147233,1,1,2012-02-02,5,3f9f49b5-e410-4948-bf6e-f9244f04918b,37.0,services,MARRIED,high.school,0.0,1.0,0.0,telephone,226,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,15-febrero-2019,34.939,-94.847
3,121393,1,2,2012-12-21,29,9991fafb-4447-451a-8be2-b0df6098d13e,40.0,admin.,MARRIED,basic.6y,0.0,0.0,0.0,telephone,151,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,29-noviembre-2015,49.041,-70.308
4,63164,1,2,2012-06-20,20,eca60b76-70b6-4077-80ba-bc52e8ebb0eb,56.0,services,MARRIED,high.school,0.0,0.0,1.0,telephone,307,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,29-enero-2017,38.033,-104.463

## Cambiamos los valores de las columnas a min칰scula

Si recordamos de Python b치sico ten칤amos el m칠todo `.lower()` de los *strings* que nos permit칤a poner en min칰scula todas sus letras. En Pandas vamos a tener el m칠todo `str.lower()` el cual se utiliza para convertir los valores de una columna de tipo string a min칰sculas. 

Aqu칤 tienes la sintaxis b치sica del m칠todo `str.lower()`:

```python
dataframe[columna].str.lower()
```

游뚿 **NOTA** De la misma forma que hemos usado el m칠todo `str.lower()` para poner en min칰sculas podremos usar otros m칠todos de los *strings* en Pandas siguiendo la misma sintaxis (por ejemplo `str.upper()`, `str.capitalize()`, `str.strip()`, etc.)

In [18]:
# aplicamos el m칠todo '.str.lower()' a la columna de 'marital' y vemos que lo hemos conseguido cambiar, pero este cambio no se ha aplicado en el DataFrame
# lo que vamos a hacer es sobreescribir el nombre de la columna 
df_final["marital"].str.lower()

0        married
1        married
2        married
3        married
4        married
          ...
42995    married
42996    married
42997     single
42998    married
42999     single
Name: marital, Length: 43000, dtype: object

In [19]:
# sobreescribimos los valores de las columnas 
df_final["marital"] = df_final["marital"].str.lower()

# comprobamos si se han efectuado los cambios
df_final.head()

,income,kidhome,teenhome,dt_customer,numwebvisitsmonth,id,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,empvarrate,conspriceidx,consconfidx,euribor3m,nremployed,y,date,latitude,longitude
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079,NaN,housemaid,married,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233
1,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097,57.0,services,married,high.school,NaN,0.0,0.0,telephone,149,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,14-septiembre-2016,34.601,-83.923
2,147233,1,1,2012-02-02,5,3f9f49b5-e410-4948-bf6e-f9244f04918b,37.0,services,married,high.school,0.0,1.0,0.0,telephone,226,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,15-febrero-2019,34.939,-94.847
3,121393,1,2,2012-12-21,29,9991fafb-4447-451a-8be2-b0df6098d13e,40.0,admin.,married,basic.6y,0.0,0.0,0.0,telephone,151,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,29-noviembre-2015,49.041,-70.308
4,63164,1,2,2012-06-20,20,eca60b76-70b6-4077-80ba-bc52e8ebb0eb,56.0,services,married,high.school,0.0,0.0,1.0,telephone,307,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,29-enero-2017,38.033,-104.463

In [20]:
# hacemos lo mismo para la columna 'poutcome'
df_final["poutcome"] = df_final["poutcome"].str.lower()

# comprobamos si se hicieron los cambios
df_final.head()

,income,kidhome,teenhome,dt_customer,numwebvisitsmonth,id,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,empvarrate,conspriceidx,consconfidx,euribor3m,nremployed,y,date,latitude,longitude
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079,NaN,housemaid,married,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233
1,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097,57.0,services,married,high.school,NaN,0.0,0.0,telephone,149,1,999,0,nonexistent,1.1,"93,994","-36,4",NaN,5191,no,14-septiembre-2016,34.601,-83.923
2,147233,1,1,2012-02-02,5,3f9f49b5-e410-4948-bf6e-f9244f04918b,37.0,services,married,high.school,0.0,1.0,0.0,telephone,226,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,15-febrero-2019,34.939,-94.847
3,121393,1,2,2012-12-21,29,9991fafb-4447-451a-8be2-b0df6098d13e,40.0,admin.,married,basic.6y,0.0,0.0,0.0,telephone,151,1,999,0,nonexistent,1.1,"93,994","-36,4",NaN,5191,no,29-noviembre-2015,49.041,-70.308
4,63164,1,2,2012-06-20,20,eca60b76-70b6-4077-80ba-bc52e8ebb0eb,56.0,services,married,high.school,0.0,0.0,1.0,telephone,307,1,999,0,nonexistent,1.1,"93,994","-36,4",NaN,5191,no,29-enero-2017,38.033,-104.463

## Creamos dos columnas nuevas con el a침o y el mes de la fecha en que se contactaron a los clientes en la campa침a de marketing

En este caso, vamos a hacer una menci칩n especial al m칠todo `str.split()`. Este m칠todo se utiliza para dividir una columna de texto en partes m치s peque침as utilizando un delimitador espec칤fico (igual que hac칤amos con los *strings* de Python). Crea una nueva columna de tipo lista donde cada elemento es una lista de las partes separadas del texto original.

Aqu칤 tienes la sintaxis b치sica del m칠todo `str.split()`:

```python
dataframe[columna].str.split(pat=None, n=-1, expand=False)
```

Los par치metros son:

- `pat`: El patr칩n o delimitador utilizado para separar el texto. Puede ser una cadena de caracteres o una expresi칩n regular. Si no se proporciona ning칰n valor, se utilizar치 un espacio en blanco como delimitador predeterminado.

- `n` (opcional): El n칰mero m치ximo de divisiones a realizar. Por defecto, se realizan todas las divisiones posibles.

- `expand` (opcional): Indica si se debe expandir la serie en un DataFrame resultante con cada parte separada en una columna diferente. Por defecto es `False`, lo que significa que se devuelve una serie de listas.

- `regex` (opcional): indica si el patr칩n utilizado para separar el texto debe ser interpretado como una expresi칩n regular. Por defecto, regex se establece en False, lo que significa que el patr칩n se interpreta como una cadena de caracteres literal.

In [21]:
# en este caso vamos a separar la columna `date` por los '-'
# como vemos esto nos ha devuelto una nueva serie (columna) que contiene listas.
df_final["date"].str.split("-")

0             [2, agosto, 2019]
1        [14, septiembre, 2016]
2           [15, febrero, 2019]
3         [29, noviembre, 2015]
4             [29, enero, 2017]
                  ...
42995       [13, octubre, 2015]
42996         [17, marzo, 2018]
42997    [15, septiembre, 2016]
42998    [23, septiembre, 2019]
42999      [6, noviembre, 2019]
Name: date, Length: 43000, dtype: object

In [22]:
# pero a nosotros lo que realmente nos interesa tener en una columna el mes y en otra el a침o, 
# para hacer eso utilizaremos el par치metro 'expand'
# fijaos como ahora ya no tenemos solo una columna, si no tres, donde en cada una de ellas tenemos un elemento resultado del split
df_final["date"].str.split("-", expand = True)

        0           1     2
0       2      agosto  2019
1      14  septiembre  2016
2      15     febrero  2019
3      29   noviembre  2015
4      29       enero  2017
...    ..         ...   ...
42995  13     octubre  2015
42996  17       marzo  2018
42997  15  septiembre  2016
42998  23  septiembre  2019
42999   6   noviembre  2019

[43000 rows x 3 columns]

In [23]:
# ya solo nos queda un detalle, y es que de las tres columnas solo nos interesan dos.
# para quedarnos con las dos columnas que queremos usaremos el m칠todo 'get()' indicando el nombre de las columnas que nos interesan 
# adem치s recordad que tendremos que crear las dos columnas nuevas
df_final[["contact_month", "contact_year"]] = df_final["date"].str.split("-", expand = True).get([1,2])

# comprobamos que se han creado correctamente las columnas
df_final.head(2)

,income,kidhome,teenhome,dt_customer,numwebvisitsmonth,id,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,empvarrate,conspriceidx,consconfidx,euribor3m,nremployed,y,date,latitude,longitude,contact_month,contact_year
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079,NaN,housemaid,married,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,agosto,2019
1,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097,57.0,services,married,high.school,NaN,0.0,0.0,telephone,149,1,999,0,nonexistent,1.1,"93,994","-36,4",NaN,5191,no,14-septiembre-2016,34.601,-83.923,septiembre,2016

## Reemplazamos los '.' por espacios en la columna `education`

En este caso lo que queremos hacer es un reemplazo de los '.' por espacios en una columna que es de tipo *string*, por lo tanto, como hasta ahora usaremos el m칠todo `str.replace` de Pandas. Este m칠todo se utiliza para reemplazar ocurrencias de una subcadena en una columna de tipo string por otra subcadena especificada.

Aqu칤 tienes la sintaxis b치sica del m칠todo `str.replace()`:

```python
dataframe[columna].str.replace(pat, repl, n=-1, case=True, regex=False)
```

Sus par치metros son:

- `pat`: La subcadena a buscar y reemplazar.

- `repl`: La subcadena que se utilizar치 como reemplazo.

- `n` (opcional): El n칰mero m치ximo de ocurrencias a reemplazar. Por defecto, se reemplazan todas las ocurrencias.

- `case` (opcional): Indica si la b칰squeda y el reemplazo deben ser sensibles a may칰sculas y min칰sculas. Por defecto, es `True`.

- `regex` (opcional): Indica si el patr칩n debe ser interpretado como una expresi칩n regular. Por defecto, es `False`.

In [24]:
# en este caso vamos ha reemplazar los '.' de la columna 'education' por espacios
# vamos a almacenar los cambios de esta columna en la misma columna, vamos a sobreescribir sus valores
df_final["education"] = df_final["education"].str.replace(".", " ")

# chequeamos que el cambio se hizo correctamente
df_final.head()

,income,kidhome,teenhome,dt_customer,numwebvisitsmonth,id,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,empvarrate,conspriceidx,consconfidx,euribor3m,nremployed,y,date,latitude,longitude,contact_month,contact_year
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079,NaN,housemaid,married,basic 4y,0.0,0.0,0.0,telephone,261,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,agosto,2019
1,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097,57.0,services,married,high school,NaN,0.0,0.0,telephone,149,1,999,0,nonexistent,1.1,"93,994","-36,4",NaN,5191,no,14-septiembre-2016,34.601,-83.923,septiembre,2016
2,147233,1,1,2012-02-02,5,3f9f49b5-e410-4948-bf6e-f9244f04918b,37.0,services,married,high school,0.0,1.0,0.0,telephone,226,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,15-febrero-2019,34.939,-94.847,febrero,2019
3,121393,1,2,2012-12-21,29,9991fafb-4447-451a-8be2-b0df6098d13e,40.0,admin.,married,basic 6y,0.0,0.0,0.0,telephone,151,1,999,0,nonexistent,1.1,"93,994","-36,4",NaN,5191,no,29-noviembre-2015,49.041,-70.308,noviembre,2015
4,63164,1,2,2012-06-20,20,eca60b76-70b6-4077-80ba-bc52e8ebb0eb,56.0,services,married,high school,0.0,0.0,1.0,telephone,307,1,999,0,nonexistent,1.1,"93,994","-36,4",NaN,5191,no,29-enero-2017,38.033,-104.463,enero,2017

## Filtrado de datos

El filtrado de datos es una etapa fundamental en el proceso de limpieza de un *DataFrame* para los analistas de datos. Aqu칤 os explicamos algunas razones por las cuales el filtrado de datos es importante en este contexto:

1. **Eliminaci칩n de datos irrelevantes**: Los *DataFrames* suelen contener una gran cantidad de datos, y muchos de ellos pueden no ser relevantes para el an치lisis que se va a realizar. Mediante el filtrado, se pueden eliminar las filas o columnas que no aportan informaci칩n 칰til, lo que ayuda a reducir el ruido y a enfocarse en los datos que son realmente importantes.

2. **Tratamiento de valores faltantes**: Los valores faltantes, tambi칠n conocidos como valores nulos o NaN, son comunes en los conjuntos de datos reales. El filtrado permite identificar y manejar adecuadamente estos valores faltantes. Puedes decidir eliminar las filas o columnas que contienen valores nulos si su ausencia no afecta significativamente al an치lisis, o puedes aplicar t칠cnicas como la imputaci칩n para rellenar los valores faltantes con estimaciones adecuadas.

4. **Filtrado por condiciones espec칤ficas**: A menudo, los analistas de datos necesitan trabajar con subconjuntos de datos que cumplen ciertas condiciones o criterios. El filtrado permite seleccionar las filas que satisfacen una o varias condiciones espec칤ficas, lo que facilita el an치lisis focalizado en un grupo espec칤fico de datos de inter칠s. Esto puede ayudar a obtener informaci칩n m치s precisa y relevante para el an치lisis.

En Pandas, existen varios m칠todos que podremos utilizar para filtrar datos en un *DataFrame*. Aqu칤 os presentamos algunos de los m칠todos m치s comunes:

1. **Operadores de comparaci칩n**: Se pueden utilizar operadores de comparaci칩n, como `>`, `<`, `>=`, `<=`, `==`, `!=`, para crear condiciones de filtrado basadas en los valores de una columna o varias columnas.

2. **M칠todo `isin()`**: Se utiliza para filtrar filas en base a una lista de valores permitidos. Se utiliza para seleccionar las filas que contienen valores espec칤ficos en una columna.

3. **M칠todo `between()`**: Se utiliza para filtrar filas en base a un rango de valores. Permite seleccionar las filas que tienen valores dentro de un rango especificado en una columna.

4. **M칠todo `str.contains()`**: Se utiliza para filtrar datos basados en la presencia de una subcadena en una serie de objetos de tipo string. Este m칠todo devuelve un booleano que indica si cada elemento de la serie contiene o no la subcadena especificada.


### Operadores de comparaci칩n 

La forma de filtrado en pandas utilizando operadores de comparaci칩n es una t칠cnica muy com칰n y 칰til para seleccionar filas basadas en condiciones espec칤ficas. Aqu칤 ten칠is una explicaci칩n de c칩mo funciona:

1. **Crear una condici칩n**: Primero, necesitaremos crear una condici칩n utilizando uno o m치s operadores de comparaci칩n, como `>`, `<`, `>=`, `<=`, `==`, `!=`. Estos operadores se utilizan para comparar los valores de una columna o varias columnas con un valor o una expresi칩n. 

2. **Aplicar la condici칩n de filtrado**: Una vez que tenemos la condici칩n, podemos aplicarla directamente dentro de corchetes `[]` al DataFrame. Esto devolver치 solo las filas que cumplan la condici칩n.

3. **Combinar condiciones**: Tambi칠n es posible combinar varias condiciones utilizando los operadores l칩gicos `&` (and) y `|` (or) para crear condiciones m치s complejas (como lo hac칤amos en NumPy).

In [39]:
# recordemos el DataFrame
df_final.head(2)

,income,kidhome,teenhome,dt_customer,numwebvisitsmonth,id,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,empvarrate,conspriceidx,consconfidx,euribor3m,nremployed,y,date,latitude,longitude,contact_month,contact_year
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079,NaN,housemaid,married,basic 4y,0.0,0.0,0.0,telephone,261,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,agosto,2019
1,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097,57.0,services,married,high school,NaN,0.0,0.0,telephone,149,1,999,0,nonexistent,1.1,"93,994","-36,4",NaN,5191,no,14-septiembre-2016,34.601,-83.923,septiembre,2016

In [25]:
# imaginemos que queremos quedarnos solo con aquellos clientes que est치n casados 
# primero establecemos la condici칩n de filtrado que queremos, en este caso que la columna de 'marital' sea igual a 'married'
condicion_casados = df_final["marital"] == "married"

# ahora aplicamos la condicion definida previamente a todo el DataFrame, esto lo haremos usando la sintaxis con corchetes
# vamos a almancenar los resultados en una variable que se llame 'df_casados'
df_casados = df_final[condicion_casados]

# comprobamos que el filtrado se hizo correctamente, en este caso, la columna 'marital' deber치 tener un 칰nico valor  ('married')
df_casados["marital"].unique()

array(['married'], dtype=object)

In [41]:
# visualizamos el DataFrame
df_casados.head()

,income,kidhome,teenhome,dt_customer,numwebvisitsmonth,id,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,empvarrate,conspriceidx,consconfidx,euribor3m,nremployed,y,date,latitude,longitude,contact_month,contact_year
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079,NaN,housemaid,married,basic 4y,0.0,0.0,0.0,telephone,261,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,agosto,2019
1,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097,57.0,services,married,high school,NaN,0.0,0.0,telephone,149,1,999,0,nonexistent,1.1,"93,994","-36,4",NaN,5191,no,14-septiembre-2016,34.601,-83.923,septiembre,2016
2,147233,1,1,2012-02-02,5,3f9f49b5-e410-4948-bf6e-f9244f04918b,37.0,services,married,high school,0.0,1.0,0.0,telephone,226,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,15-febrero-2019,34.939,-94.847,febrero,2019
3,121393,1,2,2012-12-21,29,9991fafb-4447-451a-8be2-b0df6098d13e,40.0,admin.,married,basic 6y,0.0,0.0,0.0,telephone,151,1,999,0,nonexistent,1.1,"93,994","-36,4",NaN,5191,no,29-noviembre-2015,49.041,-70.308,noviembre,2015
4,63164,1,2,2012-06-20,20,eca60b76-70b6-4077-80ba-bc52e8ebb0eb,56.0,services,married,high school,0.0,0.0,1.0,telephone,307,1,999,0,nonexistent,1.1,"93,994","-36,4",NaN,5191,no,29-enero-2017,38.033,-104.463,enero,2017

In [42]:
# podr칤amos filtrar tambi칠n con operadores de comparaci칩n, por ejemplo imaginemos que queremos quedarnos solo con los datos de aquellos clientes que tienen un 'income' mayor de 150000
condicion_income = df_final["income"] > 150000

# aplicamos el filtro al DataFrame
df_income_150 = df_final[condicion_income]

# comprobamos que el filtrado se hizo correctamente, en este caso el valor m칤nimo que tengamos para esta columna deber치 ser mayor que 150000, para eso vamos a usar el m칠todo '.min()' de Pandas
df_income_150["income"].min()

150008

In [43]:
df_income_150.head()

,income,kidhome,teenhome,dt_customer,numwebvisitsmonth,id,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,empvarrate,conspriceidx,consconfidx,euribor3m,nremployed,y,date,latitude,longitude,contact_month,contact_year
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079,NaN,housemaid,married,basic 4y,0.0,0.0,0.0,telephone,261,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,agosto,2019
7,159686,1,1,2012-12-10,21,87fdc08b-30ae-4dab-803f-561ecdf27ff0,NaN,blue-collar,married,NaN,NaN,0.0,0.0,telephone,217,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,25-septiembre-2017,46.871,-122.235,septiembre,2017
8,179933,0,0,2012-08-22,18,87b79988-2be5-419d-88f4-56655852c565,24.0,technician,single,professional course,0.0,1.0,0.0,telephone,380,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,18-enero-2018,44.632,-85.811,enero,2018
19,173275,2,0,2012-04-17,26,74bf1569-4bdb-49e4-98ba-c1c607d90596,39.0,management,single,basic 9y,NaN,0.0,0.0,telephone,195,1,999,0,nonexistent,1.1,"93,994","-36,4",NaN,5191,no,1-julio-2017,27.284,-69.955,julio,2017
21,158116,0,2,2012-10-08,21,47591c83-e88b-40c2-bb8e-de40b94a44cb,55.0,blue-collar,married,basic 4y,NaN,1.0,0.0,telephone,262,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,11-agosto-2016,25.892,-92.643,agosto,2016

In [44]:
# 쯫 si quisieramos juntar dos condiciones? Tendr칤amos que utilizar el operador "&" (si queremos un and) o el operador "|" (si queremos un or)
# en este caso vamos a buscar aquellos clientes que est치n casado Y que tienen un 'income' mayor que 150000

df_income_casados = df_final[condicion_casados & condicion_income]
df_income_casados.head(2)

,income,kidhome,teenhome,dt_customer,numwebvisitsmonth,id,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,empvarrate,conspriceidx,consconfidx,euribor3m,nremployed,y,date,latitude,longitude,contact_month,contact_year
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079,NaN,housemaid,married,basic 4y,0.0,0.0,0.0,telephone,261,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,agosto,2019
7,159686,1,1,2012-12-10,21,87fdc08b-30ae-4dab-803f-561ecdf27ff0,NaN,blue-collar,married,NaN,NaN,0.0,0.0,telephone,217,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,25-septiembre-2017,46.871,-122.235,septiembre,2017

### M칠todo `.isin()`

La funci칩n `isin()` en pandas se utiliza para filtrar datos en base a una lista de valores permitidos. Permite seleccionar filas en un *DataFrame* cuyos valores en una columna espec칤fica coinciden con cualquiera de los valores proporcionados en la lista.

Aqu칤 ten칠is una explicaci칩n de c칩mo usar `isin()` en el filtrado de pandas:

1. **Crear una lista de valores permitidos**: Primero, necesitaremos crear una lista que contenga los valores que deseamos permitir en el filtrado. Pueden ser valores 칰nicos o una lista de varios valores. 

2. **Aplicar la funci칩n `isin()`**: Una vez que tenemos la lista de valores permitidos, podemos aplicar la funci칩n `isin()` a la columna deseada en el DataFrame utilizando corchetes `[]`.

Su sintaxis b치sica es: 
```python
dataframe[columna].isin(valores)
```
Donde:
- `dataframe`: Especifica el nombre del DataFrame sobre el que queremos aplicar el m칠todo. 

- `columna`: Especifica la columna del DataFrame en la que se aplicar치 el m칠todo.

- `valores`: Puede ser una lista, una Serie o un array-like que contiene los valores que se desean comprobar.

In [45]:
df_final.head()

,income,kidhome,teenhome,dt_customer,numwebvisitsmonth,id,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,empvarrate,conspriceidx,consconfidx,euribor3m,nremployed,y,date,latitude,longitude,contact_month,contact_year
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079,NaN,housemaid,married,basic 4y,0.0,0.0,0.0,telephone,261,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,agosto,2019
1,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097,57.0,services,married,high school,NaN,0.0,0.0,telephone,149,1,999,0,nonexistent,1.1,"93,994","-36,4",NaN,5191,no,14-septiembre-2016,34.601,-83.923,septiembre,2016
2,147233,1,1,2012-02-02,5,3f9f49b5-e410-4948-bf6e-f9244f04918b,37.0,services,married,high school,0.0,1.0,0.0,telephone,226,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,15-febrero-2019,34.939,-94.847,febrero,2019
3,121393,1,2,2012-12-21,29,9991fafb-4447-451a-8be2-b0df6098d13e,40.0,admin.,married,basic 6y,0.0,0.0,0.0,telephone,151,1,999,0,nonexistent,1.1,"93,994","-36,4",NaN,5191,no,29-noviembre-2015,49.041,-70.308,noviembre,2015
4,63164,1,2,2012-06-20,20,eca60b76-70b6-4077-80ba-bc52e8ebb0eb,56.0,services,married,high school,0.0,0.0,1.0,telephone,307,1,999,0,nonexistent,1.1,"93,994","-36,4",NaN,5191,no,29-enero-2017,38.033,-104.463,enero,2017

In [46]:
df_final["education"].unique()

array(['basic 4y', 'high school', 'basic 6y', 'basic 9y',
       'professional course', nan, 'university degree', 'illiterate'],
      dtype=object)

In [47]:
# imaginemos que nos interesan solo los clientes que tienen un nivel de educaci칩n de 'basic 6y', 'basic 9y'. 
# podr칤amos usar lo m칠todos aprendidos previamente, pero la realidad es que cuantas m치s condiciones pongamos m치s probabilidad hay en equivocarnos. 
# para eso usaremos el m칠todo 'isin()' 

# primero definimos una lista con los valores que queremos filtrar
filtro_educacion = ['basic 6y', 'basic 9y']

# aplicamos el m칠todo 'isin()' pasando la lista
df_educacion = df_final[df_final["education"].isin(filtro_educacion)]

# comprobamos que ahora solo tenemos dos valores 칰nicos para la columna ' education'
df_educacion["education"].unique()

array(['basic 6y', 'basic 9y'], dtype=object)

### M칠todo `.between()`

El m칠todo `between` en Pandas se utiliza para filtrar filas de un DataFrame o una Serie bas치ndose en un rango num칠rico o de fechas. Comprueba si los valores de la columna seleccionada est치n dentro del rango especificado y devuelve una m치scara booleana que indica qu칠 filas cumplen con la condici칩n.

La sintaxis del m칠todo `between` es la siguiente:
```python
dataframe[columna].between(inicio, fin, inclusive=True)
```
Donde:

- `dataframe`: Especifica el nombre del DataFrame sobre el que queremos aplicar el m칠todo. 

- `columna`: Especifica la columna del DataFrame en la que se aplicar치 el m칠todo.

- `inicio` y `fin`: Indican los l칤mites del rango.

- `inclusive`: Es un par치metro opcional que determina si los l칤mites del rango son inclusivos o exclusivos. Sus valores pueden ser:
    
    - both: incluye el inicio y el final. 

    - left: incluye el incio pero no el fin. 

    - right: incluye el fin pero no el inicio.

    - neither: no incluye el inicio ni el final.

In [48]:
df_final.head(1)

,income,kidhome,teenhome,dt_customer,numwebvisitsmonth,id,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,empvarrate,conspriceidx,consconfidx,euribor3m,nremployed,y,date,latitude,longitude,contact_month,contact_year
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079,NaN,housemaid,married,basic 4y,0.0,0.0,0.0,telephone,261,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,agosto,2019

In [49]:
# imaginemos que queremos saber que clientes han visitado nuestra p치gina web entre 15 y 25 veces (inclusive), lo podr칤amos hacer con cualquiera de los m칠todos aprendidos hasta ahora, pero ser칤a muy tedioso
# veamos como hacerlo con el m칠todo '.between()'

df_web = df_final[df_final["numwebvisitsmonth"].between(15, 25, inclusive = "both" )]
df_web.head()

,income,kidhome,teenhome,dt_customer,numwebvisitsmonth,id,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,empvarrate,conspriceidx,consconfidx,euribor3m,nremployed,y,date,latitude,longitude,contact_month,contact_year
4,63164,1,2,2012-06-20,20,eca60b76-70b6-4077-80ba-bc52e8ebb0eb,56.0,services,married,high school,0.0,0.0,1.0,telephone,307,1,999,0,nonexistent,1.1,"93,994","-36,4",NaN,5191,no,29-enero-2017,38.033,-104.463,enero,2017
7,159686,1,1,2012-12-10,21,87fdc08b-30ae-4dab-803f-561ecdf27ff0,NaN,blue-collar,married,NaN,NaN,0.0,0.0,telephone,217,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,25-septiembre-2017,46.871,-122.235,septiembre,2017
8,179933,0,0,2012-08-22,18,87b79988-2be5-419d-88f4-56655852c565,24.0,technician,single,professional course,0.0,1.0,0.0,telephone,380,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,18-enero-2018,44.632,-85.811,enero,2018
9,77504,1,0,2012-02-09,18,ea6b7d04-9271-4c0a-a01f-07795d164aba,25.0,services,single,high school,0.0,1.0,0.0,telephone,50,1,999,0,nonexistent,1.1,"93,994","-36,4",NaN,5191,no,2-noviembre-2016,30.297,-117.382,noviembre,2016
12,102006,0,1,2012-03-24,18,66a752e2-b2f1-440c-9a8f-cc3b10d74dd0,29.0,blue-collar,single,high school,0.0,0.0,1.0,telephone,137,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,14-junio-2016,30.047,-112.472,junio,2016

In [50]:
# este m칠todo tambi칠n se puede aplicar para columnas de tipo datetime, pero antes de eso tendremos que ver que columna tenemos de ese tipo, para eso usaremos el m칠todo '.dtypes()'
# si nos fijamos la columna 'dt_customer' es de tipo datetime y nos daba la informaci칩n de en que fecha pasaron a ser clientes del banco
df_final.dtypes

income                        int64
kidhome                       int64
teenhome                      int64
dt_customer          datetime64[ns]
numwebvisitsmonth             int64
id                           object
age                         float64
job                          object
marital                      object
education                    object
default                     float64
housing                     float64
loan                        float64
contact                      object
duration                      int64
campaign                      int64
pdays                         int64
previous                      int64
poutcome                     object
empvarrate                  float64
conspriceidx                 object
consconfidx                  object
euribor3m                    object
nremployed                   object
y                            object
date                         object
latitude                    float64
longitude                   float64
contact_month                object
contact_year                 object
dtype: object

In [51]:
# imaginemos que queremos saber que clientes entraron en el banco en enero del 2013. 
# lo primero que tendremos que hacer es generar dos objetos de tipo datetime con las fechas de inicio y fin de nuestro filtro
# para eso usaremos el m칠todo 'pd.to_datetime()' el cual necesita que le pasemos las fechas en formato string
inicio = pd.to_datetime('2013-01-01')
fin = pd.to_datetime('2013-01-31')

# despu칠s le pasaremos esas dos variables creadas al m칠todo '.between()' 
df_fechas = df_final[df_final["dt_customer"].between(inicio, fin, inclusive = "both")]
df_fechas.head(2)

,income,kidhome,teenhome,dt_customer,numwebvisitsmonth,id,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,empvarrate,conspriceidx,consconfidx,euribor3m,nremployed,y,date,latitude,longitude,contact_month,contact_year
20021,113859,1,1,2013-01-06,12,f8aaf334-949d-4943-a214-b64fe9c088b4,52.0,services,married,high school,NaN,1.0,0.0,cellular,99,1,999,0,nonexistent,1.4,"93,444","-36,1",NaN,"5228,1",no,15-septiembre-2016,32.499,-115.779,septiembre,2016
20028,169825,2,2,2013-01-01,10,9df0599f-1bc9-4772-9289-b6f9a8178714,51.0,technician,married,professional course,NaN,1.0,1.0,cellular,273,1,999,0,nonexistent,1.4,"93,444","-36,1","4,965","5228,1",no,6-noviembre-2015,48.691,-73.914,noviembre,2015

### M칠todo `.str.contains()`

El m칠todo `str.contains()` se utiliza en Python para verificar si un patr칩n de texto espec칤fico est치 presente en una serie de objetos de tipo cadena.

La sintaxis general del m칠todo `str.contains()` es la siguiente:
```python
dataframe[columna].str.contains(pat, case=True, na=nan, regex=True)
```

Donde:

- `dataframe`: Especifica el nombre del DataFrame sobre el que queremos aplicar el m칠todo. 

- `columna`: Especifica la columna del DataFrame en la que se aplicar치 el m칠todo.

- `pat`: Es el patr칩n de texto que deseas buscar en la columna.

- `case` (opcional):  Indica si se debe realizar una b칰squeda sensible a may칰sculas y min칰sculas. El valor predeterminado es `True`, lo que significa que se realiza una b칰squeda sensible a may칰sculas y min칰sculas.

- `na`(opcional): Lo tendremos que usar si nuestra columna tiene nulos. Nos ayuda a gestionar los nulos (si lo hay) de la columna. Toma dos valores True, si hay nulos los ignora y los incluye en el resultado; False, si hay nulos los ignora y no los incluye en el resultado.

- `regex` (opcional): Indica si el patr칩n dado debe tratarse como una expresi칩n regular. El valor predeterminado es `True`, lo que significa que el patr칩n se interpreta como una expresi칩n regular.

In [52]:
df_final.head(2)

,income,kidhome,teenhome,dt_customer,numwebvisitsmonth,id,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,empvarrate,conspriceidx,consconfidx,euribor3m,nremployed,y,date,latitude,longitude,contact_month,contact_year
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079,NaN,housemaid,married,basic 4y,0.0,0.0,0.0,telephone,261,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,agosto,2019
1,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097,57.0,services,married,high school,NaN,0.0,0.0,telephone,149,1,999,0,nonexistent,1.1,"93,994","-36,4",NaN,5191,no,14-septiembre-2016,34.601,-83.923,septiembre,2016

In [27]:
df_final.isnull().sum()

income                  0
kidhome                 0
teenhome                0
dt_customer             0
numwebvisitsmonth       0
id                      0
age                  5120
job                   345
marital                85
education            1807
default              8981
housing              1026
loan                 1026
contact                 0
duration                0
campaign                0
pdays                   0
previous                0
poutcome                0
empvarrate              0
conspriceidx          471
consconfidx             0
euribor3m            9256
nremployed              0
y                       0
date                  248
latitude                0
longitude               0
contact_month         248
contact_year          248
dtype: int64

In [54]:
# imaginemos que queremos trabajar con la columna de 'education' y quisieramos sacar todos aquellos clientes que en su educaci칩n aparece un d칤gito
# lo primero que debemos hacer es sacar el patr칩n de regex
patron_regex = "\d+"

df_numeros = df_final[df_final["education"].str.contains(patron_regex, regex = True, na = False)]
df_numeros.head()

,income,kidhome,teenhome,dt_customer,numwebvisitsmonth,id,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,empvarrate,conspriceidx,consconfidx,euribor3m,nremployed,y,date,latitude,longitude,contact_month,contact_year
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079,NaN,housemaid,married,basic 4y,0.0,0.0,0.0,telephone,261,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,agosto,2019
3,121393,1,2,2012-12-21,29,9991fafb-4447-451a-8be2-b0df6098d13e,40.0,admin.,married,basic 6y,0.0,0.0,0.0,telephone,151,1,999,0,nonexistent,1.1,"93,994","-36,4",NaN,5191,no,29-noviembre-2015,49.041,-70.308,noviembre,2015
5,143854,0,1,2012-01-24,26,d63ede72-0b6d-45b1-8872-385ac6897f65,45.0,services,married,basic 9y,NaN,0.0,0.0,telephone,198,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,26-septiembre-2015,24.689,-101.643,septiembre,2015
13,140801,2,1,2012-02-11,32,54b1ea8a-a909-45d9-9562-775b64ac9c29,57.0,housemaid,divorced,basic 4y,0.0,1.0,0.0,telephone,293,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,25-agosto-2015,28.873,-70.852,agosto,2015
14,73262,2,2,2012-09-10,27,3a7b7570-aba9-40bc-9f80-3433d064b5b7,35.0,blue-collar,married,basic 6y,0.0,1.0,0.0,telephone,146,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,19-septiembre-2016,36.188,-109.835,septiembre,2016

In [55]:
# para entender que hace bien el par치metro 'na', ejecutemos de nuevo el c칩digo cambiando el valor de 'na = True'
# en este caso vemos que tenemos algunas filas m치s, como la que tiene 칤ndice 5 que no aparec칤a en el ejercicio anterior. 
df_numeros = df_final[df_final["education"].str.contains(patron_regex, regex = True, na = True)]
df_numeros.head()

,income,kidhome,teenhome,dt_customer,numwebvisitsmonth,id,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,empvarrate,conspriceidx,consconfidx,euribor3m,nremployed,y,date,latitude,longitude,contact_month,contact_year
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079,NaN,housemaid,married,basic 4y,0.0,0.0,0.0,telephone,261,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,agosto,2019
3,121393,1,2,2012-12-21,29,9991fafb-4447-451a-8be2-b0df6098d13e,40.0,admin.,married,basic 6y,0.0,0.0,0.0,telephone,151,1,999,0,nonexistent,1.1,"93,994","-36,4",NaN,5191,no,29-noviembre-2015,49.041,-70.308,noviembre,2015
5,143854,0,1,2012-01-24,26,d63ede72-0b6d-45b1-8872-385ac6897f65,45.0,services,married,basic 9y,NaN,0.0,0.0,telephone,198,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,26-septiembre-2015,24.689,-101.643,septiembre,2015
7,159686,1,1,2012-12-10,21,87fdc08b-30ae-4dab-803f-561ecdf27ff0,NaN,blue-collar,married,NaN,NaN,0.0,0.0,telephone,217,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,25-septiembre-2017,46.871,-122.235,septiembre,2017
10,92882,1,1,2012-01-05,9,8d700df5-0c33-4517-8cf8-92e1c92c9c12,41.0,blue-collar,married,NaN,NaN,0.0,0.0,telephone,55,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,31-noviembre-2015,43.616,-90.902,noviembre,2015

In [28]:
# antes de terminar la lecci칩n vamos a guardar este DataFrame que hemos hemos creado a lo largo de la lecci칩n para usarlo en la lecci칩n de ma침ana
# para eso usaremos el m칠todo 'pd.to_csv()' 

df_final.to_csv("datos/bank-additional_full.csv")

# Resumen de los m칠todos aprendidos

| M칠todo             | Descripci칩n                                         | Ejemplo en Python                                   |
|--------------------|-----------------------------------------------------|------------------------------------------------------|
| `concat`           | Combina DataFrames a lo largo de un eje espec칤fico. | ```result = pd.concat([df1, df2])```       |
| `merge`            | Combina DataFrames utilizando columnas comunes.   | ```result = pd.merge(df1, df2, on='clave')```|
| `join`             | Combina DataFrames utilizando 칤ndices o columnas.  | ```result = df1.join(df2, on='clave')```    |
| `rename`           | Cambia los nombres de columnas o 칤ndices.         | ```df.rename(columns={'anterior': 'nuevo'}, inplace=True)``` |
| `set_index`        | Establece una columna como 칤ndice del DataFrame.   | ```df.set_index('columna')```               |
| `drop`             | Elimina filas o columnas del DataFrame.            | ```df.drop(columns=['columna'], inplace=True)``` |
| `str.lower`        | Convierte el contenido de una columna a min칰sculas. | ```df['columna'].str.lower()```            |
| `str.split`        | Divide una cadena en columnas separadas.           | ```df['columna'].str.split(',')```         |
| `str.replace`      | Reemplaza una cadena o patr칩n en una columna.      | ```df['columna'].str.replace('viejo', 'nuevo')``` |
| `isin`             | Comprueba si los elementos est치n en una lista.     | ```df['columna'].isin(['valor1', 'valor2'])``` |
| `between`          | Filtra filas basadas en valores en un rango.       | ```df[df['columna'].between(5, 10)]```     |
| `str.contains`     | Comprueba si una columna contiene un patr칩n.       | ```df['columna'].str.contains('patr칩n')```  |

# Ejercicios

En este *pair programming* vamos a seguir trabajando con el *csv* de `rating-and-performance`, pero vamos a a침adir un *csv* m치s para completar la informaci칩n de nuestro *e-commerce*. En concreto, vamos a incluir: 

- `insights.csv`: Tenemos datos sobre el 칠xito de vendedores activos. Sus columnas son: 



    | Nombre de columna         | Descripci칩n                                                                                            |
    |---------------------------|--------------------------------------------------------------------------------------------------------|
    | rating                    | La calificaci칩n del producto. (Float)                                                                  |
    | listedproducts            | El n칰mero de productos listados en la plataforma de comercio electr칩nico Wish. (Integer)                |
    | totalunitssold            | El n칰mero total de unidades vendidas del producto. (Integer)                                           |
    | meanunitssoldperproduct   | El n칰mero promedio de unidades vendidas por producto. (Float)                                         |
    | merchantratingscount      | El n칰mero de calificaciones para el vendedor. (Integer)                                                |
    | meanproductprices         | El precio promedio del producto. (Float)                                                               |
    | meanretailprices          | El precio minorista promedio del producto. (Float)                                                     |
    | averagediscount           | El descuento promedio aplicado al producto. (Float)                                                    |
    | meandiscount              | El descuento medio aplicado al producto. (Float)                                                       |
    | meanproductratingscount   | El n칰mero promedio de calificaciones para el producto. (Float)                                         |
    | totalurgencycount         | El n칰mero total de recuentos de urgencia para el producto. (Integer)                                   |
    | urgencytextrate           | La tasa de ofertas de texto de urgencia para el producto. (Float)                                      |



**Los ejercicios que os planteamos son:**

1. Unid los dos DataFrames en uno solo, usando el m칠todo que considereis m치s correcto. Querremos quedarnos con todos los productos que est칠n en los dos conjuntos de datos. 

2. Explorad el nombre de las columnas, 쯛ay alguna que este repetida o que no nos aporte informaci칩n de valor? 쮿ay alguna columna que solo tenga un valor? En caso de ser as칤, eliminadlas. **NOTA** Hay tres columnas que cuando exploramos sus valores 칰nicos y sus frecuencias ayer, nos deber칤amos haber dado cuenta que solo tiene un valor.  


3. Algunas de las columnas tienen `.` en sus nombres y en otras tenemos `_`.  Unifica el nombre de las columnas para que todas tengan "_". Adem치s, todas deben estar en min칰sculas. 

4. En la columna de `merchant_info_subtitle`, si nos fijamos hay algunas celdas donde tenemos entre par칠ntesis el n칰mero total de calificaciones para el comerciante (que es la misma informaci칩n que la que tenemos en la columna "merchant_rating_count"). Eliminad de la columna "merchant_info_subtitle" la parte del *string* de los par칠ntesis. Guardar el resultado de vuestra limpieza en una columna que se llame igual, es decir, "merchant_info_subtitle". 

    <div style="display: flex;">
        <div style="flex: 1; padding-left: 10px;">
            <p> <b>Columna antes del cambio. </b></p>
            <img src="../imagenes/ejercicio4-antes.png" alt="Descripci칩n de la imagen">
        </div>
        <div style="flex: 1; padding-left: 10px;">
            <p> <b> Columna despu칠s del cambio. </b> </p>
            <img src="../imagenes/ejercicio4-despues.png" alt="Descripci칩n de la imagen">
        </div>
    </div>

5. Si nos fijamos, en la primera fila antes solo ten칤amos un par칠ntesis, pero los hemos eliminado en el paso anterior, y ahora tenemos un *string* vac칤o, lo cual no tiene mucho sentido. En este ejercicio debereis reemplazar esos *strings* vacios por nulos de Pandas (**NOTA** estos deben ser indicados de la siguiente forma `np.nan`, y deber칠is importar numpy). 

6. Hay ciertas columnas que no vamos a necesitar para nuestro an치lisis. En concreto, vamos a eliminar las columnas de `badges_count`, `product_variation_inventory`, `urgency_text`, `merchant_title`, `merchant_has_profile_picture`, `merchant_profile_picture`, `product_picture`, `total_urgency_count`, `has_urgency_banner` y `urgency_text_rate`. Guardad los cambios realizados hasta este punto en un csv para usarlo en los ejercicios de la lecci칩n de ma침ana. 

7. Pongamos en pr치ctica el filtrado de datos en Pandas: 

    - Seleccionad aquellos productos cuyo color es verde. 쮺u치ntos productos tenemos?

    - Seleccionad aquellos productos cuyo color es verde y rojo. 쮺u치ntos productos tenemos de cada tipo de color?

    - Seleccionad aquellos productos de la talla M, que valgan m치s de 15. 쮺u치ntos productos tenemos?

    - Seleccionad aquellos productos cuyo precio este entre 1 y 2 (ambos inclusive). 쮺u치ntos productos tenemos?

    - Filtrad los datos, para extraer solo aquellos productos que tengan uno o m치s d칤gitos en su titulo. 쮺u치ntos productos hay?